Public Attributes | List of all members
API_RubberArcType Struct Reference
User input management
Rubber line definition. More...
#include <APIdefs_Interface.h>
 Public Attributes
API_Coord3D  | origC
Coordinate of the center point.
bool  | radii
Draw radii as well.
char  | filler [7]
API_RubberLineThickness  | lineThick
The thickness of the line, can be APIRubberLine_Simple or APIRubberLine_Double.
API_RubberArcTypeID  | arcType
The arc is defined with arc2D (used only in 2D) or arc3D structure (APIRubberArc_OrigoAngles or APIRubberArc_ThreePoint).
union {
 struct {
 double r
Radius (or 'a' if ellipse) More...
 double angle
This value should be 0.0 in circle case or the angle of the 'a' axis of the ellipse. More...
 double ratio
This value should be 1.0 in circle case or 'a/b' of the ellipse. More...
 double begAng
Beginning angle of the arc. More...
 double endAng
Ending angle of the arc. More...
 } arc2D
 struct {
 API_Coord3D begC
Beginning point of the circular arc (defined by it's origo and two points - for 3D) More...
 API_Coord3D endC
End point of the circular arc (defined by it's origo and two points - for 3D) More...
 bool sign
The angle of the circular arc (defined by it's origo and two points - for 3D). More...
 char filler [7]
 } arc3D
};
Detailed Description
Rubber line definition.
Remarks
See ACAPI_UserInput_DrawRubberArc for utilization and example of API_RubberArcType.
Member Data Documentation
◆ [union]
 union { ... } API_RubberArcType
◆ angle
 double API_RubberArcType::angle
◆ [struct]
 struct { ... } API_RubberArcType::arc2D
◆ [struct]
 struct { ... } API_RubberArcType::arc3D
◆ arcType
 API_RubberArcType::arcType
The arc is defined with arc2D (used only in 2D) or arc3D structure (APIRubberArc_OrigoAngles or APIRubberArc_ThreePoint).
◆ begAng
 double API_RubberArcType::begAng
◆ begC
 API_Coord3D API_RubberArcType::begC
◆ endAng
 double API_RubberArcType::endAng
◆ endC
 API_Coord3D API_RubberArcType::endC
◆ filler
 char API_RubberArcType::filler[7]
◆ lineThick
 API_RubberArcType::lineThick
The thickness of the line, can be APIRubberLine_Simple or APIRubberLine_Double.
◆ origC
 API_RubberArcType::origC
Coordinate of the center point.
◆ r
 double API_RubberArcType::r
◆ radii
 API_RubberArcType::radii
Draw radii as well.
◆ ratio
 double API_RubberArcType::ratio
◆ sign
 bool API_RubberArcType::sign